foldvarid93/STM32F746G-DISCO_STemWin_FreeRTOS/Src/STemwin_wrapper.c
/**
 ******************************************************************************
 * @file    lcdconf.c
 * @author  MCD Application Team
 * @version V1.2.0
 * @date    30-December-2016
 * @brief   This file implements the configuration for the GUI library
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; Copyright (c) 2016 STMicroelectronics International N.V.
 * All rights reserved.</center></h2>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted, provided that the following conditions are met:
 *
 * 1. Redistribution of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 * 3. Neither the name of STMicroelectronics nor the names of other
 *    contributors to this software may be used to endorse or promote products
 *    derived from this software without specific written permission.
 * 4. This software, including modifications and/or derivative works of this
 *    software, must execute solely and exclusively on microcontroller or
 *    microprocessor devices manufactured by or for STMicroelectronics.
 * 5. Redistribution and use of this software other than as permitted under
 *    this license is void and will automatically terminate your rights under
 *    this license.
 *
 * THIS SOFTWARE IS PROVIDED BY STMICROELECTRONICS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS, IMPLIED OR STATUTORY WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A
 * PARTICULAR PURPOSE AND NON-INFRINGEMENT OF THIRD PARTY INTELLECTUAL PROPERTY
 * RIGHTS ARE DISCLAIMED TO THE FULLEST EXTENT PERMITTED BY LAW. IN NO EVENT
 * SHALL STMICROELECTRONICS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,
 * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
 * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
 * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 ******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include <STemwin_wrapper.h>
#include "GUI_Private.h"
#include "WM.h"
#include "stm32746g_discovery.h"
#include "stm32746g_discovery_lcd.h"
#include "stm32746g_discovery_sdram.h"
#include "stm32746g_discovery_ts.h"
/** @addtogroup LCD CONFIGURATION
 * @{
 */

/** @defgroup LCD CONFIGURATION
 * @brief This file contains the LCD Configuration
 * @{
 */

/** @defgroup LCD CONFIGURATION_Private_TypesDefinitions
 * @{
 */
/**
 * @}
 */

/** @defgroup LCD CONFIGURATION_Private_Defines
 * @{
 */
#undef  LCD_SWAP_XY
#undef  LCD_MIRROR_Y

#undef  LCD_SWAP_RB

#define LCD_SWAP_XY  1 
#define LCD_MIRROR_Y 1

#define LCD_SWAP_RB  1

#define XSIZE_PHYS 480
#define YSIZE_PHYS 272

#define NUM_BUFFERS  3 /* Number of multiple buffers to be used */
#define NUM_VSCREENS 1 /* Number of virtual screens to be used */

#define BK_COLOR GUI_DARKBLUE

#undef  GUI_NUM_LAYERS
#define GUI_NUM_LAYERS 1

#define COLOR_CONVERSION_0 GUICC_M8888I
#define DISPLAY_DRIVER_0   GUIDRV_LIN_32

#if (GUI_NUM_LAYERS > 1)
#define COLOR_CONVERSION_1 GUICC_M1555I
#define DISPLAY_DRIVER_1   GUIDRV_LIN_16

#endif

#ifndef   XSIZE_PHYS
#error Physical X size of display is not defined!
#endif
#ifndef   YSIZE_PHYS
#error Physical Y size of display is not defined!
#endif
#ifndef   NUM_VSCREENS
#define NUM_VSCREENS 1
#else
#if (NUM_VSCREENS <= 0)
#error At least one screeen needs to be defined!
#endif
#endif
#if (NUM_VSCREENS > 1) && (NUM_BUFFERS > 1)
#error Virtual screens and multiple buffers are not allowed!
#endif

/* From SDRAM */
#define LCD_LAYER0_FRAME_BUFFER  ((int)0xC0000000)
TS_StateTypeDef TS_State;
/**
 * @}
 */

/** @defgroup LCD CONFIGURATION_Private_Macros
 * @{
 */
/**
 * @}
 */

/** @defgroup LCD CONFIGURATION_Private_Variables
 * @{
 */
LTDC_HandleTypeDef hltdc;
static DMA2D_HandleTypeDef hdma2d;
static LCD_LayerPropTypedef layer_prop[GUI_NUM_LAYERS];
static const LCD_API_COLOR_CONV * apColorConvAPI[] = {
COLOR_CONVERSION_0,
#if GUI_NUM_LAYERS > 1
		COLOR_CONVERSION_1,
#endif
	};
extern volatile GUI_TIMER_TIME OS_TimeMS;
volatile char TransferInProgress = 0;
/**
 * @}
 */

/** @defgroup LCD CONFIGURATION_Private_FunctionPrototypes
 * @{
 */
static void DMA2D_CopyBuffer(U32 LayerIndex, void * pSrc, void * pDst,U32 xSize, U32 ySize, U32 OffLineSrc, U32 OffLineDst);
static void DMA2D_FillBuffer(U32 LayerIndex, void * pDst, U32 xSize, U32 ySize,	U32 OffLine, U32 ColorIndex);
static void LCD_LL_Init(void);
static void LCD_LL_LayerInit(U32 LayerIndex);

static void CUSTOM_CopyBuffer(int LayerIndex, int IndexSrc, int IndexDst);
static void CUSTOM_CopyRect(int LayerIndex, int x0, int y0, int x1, int y1,	int xSize, int ySize);
static void CUSTOM_FillRect(int LayerIndex, int x0, int y0, int x1, int y1,	U32 PixelIndex);
static void CUSTOM_DrawBitmap32bpp(int LayerIndex, int x, int y, U8 const * p, int xSize, int ySize, int BytesPerLine);
static U32 GetBufferSize(U32 LayerIndex);
/**
 * @}
 */

/** @defgroup LCD CONFIGURATION_Private_Functions
 * @{
 */
/**
 * @brief  Return Pixel format for a given layer
 * @param  LayerIndex : Layer Index
 * @retval Status ( 0 : 0k , 1: error)
 */
static inline U32 LCD_LL_GetPixelformat(U32 LayerIndex) {
	if (LayerIndex == 0) {
		return LTDC_PIXEL_FORMAT_ARGB8888;
	} else {
		return LTDC_PIXEL_FORMAT_ARGB1555;
	}
}
/*******************************************************************************
 LTDC and DMA2D BSP Routines
 *******************************************************************************/
/**
 * @brief DMA2D MSP Initialization
 *        This function configures the hardware resources used in this example:
 *           - Peripheral's clock enable
 *           - Peripheral's GPIO Configuration
 * @param hdma2d: DMA2D handle pointer
 * @retval None
 */
void HAL_DMA2D_MspInit(DMA2D_HandleTypeDef *hdma2d) {
	/* Enable peripheral */
	__HAL_RCC_DMA2D_CLK_ENABLE();
}

/**
 * @brief DMA2D MSP De-Initialization
 *        This function frees the hardware resources used in this example:
 *          - Disable the Peripheral's clock
 * @param hdma2d: DMA2D handle pointer
 * @retval None
 */
void HAL_DMA2D_MspDeInit(DMA2D_HandleTypeDef *hdma2d) {
	/* Enable DMA2D reset state */
	__HAL_RCC_DMA2D_FORCE_RESET();

