foldvarid93/STM32F746G-DISCO_STemWin_FreeRTOS/Src/STemwin_wrapper.c
	/* Release DMA2D from reset state */
	__HAL_RCC_DMA2D_RELEASE_RESET();
}

/**
 * @brief LTDC MSP Initialization
 *        This function configures the hardware resources used in this example:
 *           - Peripheral's clock enable
 *           - Peripheral's GPIO Configuration
 * @param hltdc: LTDC handle pointer
 * @retval None
 */
void HAL_LTDC_MspInit(LTDC_HandleTypeDef *hltdc) {
	GPIO_InitTypeDef gpio_init_structure;
	static RCC_PeriphCLKInitTypeDef PeriphClkInitStruct;

	/* Enable the LTDC clocks */
	__HAL_RCC_LTDC_CLK_ENABLE()
	;

	/* LCD clock configuration */
	/* PLLSAI_VCO Input = HSE_VALUE/PLL_M = 1 Mhz */
	/* PLLSAI_VCO Output = PLLSAI_VCO Input * PLLSAIN = 429 Mhz */
	/* PLLLCDCLK = PLLSAI_VCO Output/PLLSAIR = 429/5 = 85 Mhz */
	/* LTDC clock frequency = PLLLCDCLK / LTDC_PLLSAI_DIVR_2 = 85/4 = 21 Mhz */
	PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_LTDC;
	PeriphClkInitStruct.PLLSAI.PLLSAIN = 192;
	PeriphClkInitStruct.PLLSAI.PLLSAIR = 5;
	PeriphClkInitStruct.PLLSAIDivR = RCC_PLLSAIDIVR_4;
	HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct);

	/* Enable GPIOs clock */
	__HAL_RCC_GPIOE_CLK_ENABLE()
	;
	__HAL_RCC_GPIOG_CLK_ENABLE()
	;
	__HAL_RCC_GPIOI_CLK_ENABLE()
	;
	__HAL_RCC_GPIOJ_CLK_ENABLE()
	;
	__HAL_RCC_GPIOK_CLK_ENABLE()
	;

	/*** LTDC Pins configuration ***/
	/* GPIOE configuration */
	gpio_init_structure.Pin = GPIO_PIN_4;
	gpio_init_structure.Mode = GPIO_MODE_AF_PP;
	gpio_init_structure.Pull = GPIO_NOPULL;
	gpio_init_structure.Speed = GPIO_SPEED_FAST;
	gpio_init_structure.Alternate = GPIO_AF14_LTDC;
	HAL_GPIO_Init(GPIOE, &gpio_init_structure);

	/* GPIOG configuration */
	gpio_init_structure.Pin = GPIO_PIN_12;
	gpio_init_structure.Mode = GPIO_MODE_AF_PP;
	gpio_init_structure.Alternate = GPIO_AF9_LTDC;
	HAL_GPIO_Init(GPIOG, &gpio_init_structure);

	/* GPIOI LTDC alternate configuration */
	gpio_init_structure.Pin = GPIO_PIN_9 | GPIO_PIN_10 |
	GPIO_PIN_13 | GPIO_PIN_14 | GPIO_PIN_15;
	gpio_init_structure.Mode = GPIO_MODE_AF_PP;
	gpio_init_structure.Alternate = GPIO_AF14_LTDC;
	HAL_GPIO_Init(GPIOI, &gpio_init_structure);

	/* GPIOJ configuration */
	gpio_init_structure.Pin = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_3
			|
			GPIO_PIN_4 | GPIO_PIN_5 | GPIO_PIN_6 | GPIO_PIN_7 |
			GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_11 |
			GPIO_PIN_13 | GPIO_PIN_14 | GPIO_PIN_15;
	gpio_init_structure.Mode = GPIO_MODE_AF_PP;
	gpio_init_structure.Alternate = GPIO_AF14_LTDC;
	HAL_GPIO_Init(GPIOJ, &gpio_init_structure);

	/* GPIOK configuration */
	gpio_init_structure.Pin = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_4
			|
			GPIO_PIN_5 | GPIO_PIN_6 | GPIO_PIN_7;
	gpio_init_structure.Mode = GPIO_MODE_AF_PP;
	gpio_init_structure.Alternate = GPIO_AF14_LTDC;
	HAL_GPIO_Init(GPIOK, &gpio_init_structure);

	/* LCD_DISP GPIO configuration */
	gpio_init_structure.Pin = GPIO_PIN_12; /* LCD_DISP pin has to be manually controlled */
	gpio_init_structure.Mode = GPIO_MODE_OUTPUT_PP;
	HAL_GPIO_Init(GPIOI, &gpio_init_structure);

	/* LCD_BL_CTRL GPIO configuration */
	gpio_init_structure.Pin = GPIO_PIN_3; /* LCD_BL_CTRL pin has to be manually controlled */
	gpio_init_structure.Mode = GPIO_MODE_OUTPUT_PP;
	HAL_GPIO_Init(GPIOK, &gpio_init_structure);

	/* Set LTDC Interrupt to the lowest priority */
	HAL_NVIC_SetPriority(LTDC_IRQn, 0xE, 0);

	/* Enable LTDC Interrupt */
	HAL_NVIC_EnableIRQ(LTDC_IRQn);
}

/**
 * @brief LTDC MSP De-Initialization
 *        This function frees the hardware resources used in this example:
 *          - Disable the Peripheral's clock
 * @param hltdc: LTDC handle pointer
 * @retval None
 */
void HAL_LTDC_MspDeInit(LTDC_HandleTypeDef *hltdc) {
	/* Reset peripherals */
	/* Enable LTDC reset state */
	__HAL_RCC_LTDC_FORCE_RESET();

	/* Release LTDC from reset state */
	__HAL_RCC_LTDC_RELEASE_RESET();
}

/**
 * @brief  Line Event callback.
 * @param  hltdc: pointer to a LTDC_HandleTypeDef structure that contains
 *                the configuration information for the specified LTDC.
 * @retval None
 */
void HAL_LTDC_LineEvenCallback(LTDC_HandleTypeDef *hltdc) {
	U32 Addr;
	U32 layer;

	for (layer = 0; layer < GUI_NUM_LAYERS; layer++) {
		if (layer_prop[layer].pending_buffer >= 0) {
			/* Calculate address of buffer to be used  as visible frame buffer */
			Addr = layer_prop[layer].address
					+ layer_prop[layer].xSize * layer_prop[layer].ySize
							* layer_prop[layer].pending_buffer
							* layer_prop[layer].BytesPerPixel;

			__HAL_LTDC_LAYER(hltdc, layer)->CFBAR = Addr;

			__HAL_LTDC_RELOAD_CONFIG(hltdc);

			/* Notify STemWin that buffer is used */
			GUI_MULTIBUF_ConfirmEx(layer, layer_prop[layer].pending_buffer);

			/* Clear pending buffer flag of layer */
			layer_prop[layer].pending_buffer = -1;
		}
	}

	HAL_LTDC_ProgramLineEvent(hltdc, 0);
}

/*******************************************************************************
 Display configuration
 *******************************************************************************/
/**
 * @brief  Called during the initialization process in order to set up the
 *          display driver configuration
 * @param  None
 * @retval None
 */
void LCD_X_Config(void) {
	U32 i;

	LCD_LL_Init();

	/* At first initialize use of multiple buffers on demand */
#if (NUM_BUFFERS > 1)
	for (i = 0; i < GUI_NUM_LAYERS; i++) {
		GUI_MULTIBUF_ConfigEx(i, NUM_BUFFERS);
	}
#endif

	/* Set display driver and color conversion for 1st layer */
	GUI_DEVICE_CreateAndLink(DISPLAY_DRIVER_0, COLOR_CONVERSION_0, 0, 0);

	/* Set size of 1st layer */
	if (LCD_GetSwapXYEx(0)) {
		LCD_SetSizeEx(0, YSIZE_PHYS, XSIZE_PHYS);
		LCD_SetVSizeEx(0, YSIZE_PHYS * NUM_VSCREENS, XSIZE_PHYS);
	} else {
		LCD_SetSizeEx(0, XSIZE_PHYS, YSIZE_PHYS);
		LCD_SetVSizeEx(0, XSIZE_PHYS, YSIZE_PHYS * NUM_VSCREENS);
	}
#if (GUI_NUM_LAYERS > 1)

	/* Set display driver and color conversion for 2nd layer */
	GUI_DEVICE_CreateAndLink(DISPLAY_DRIVER_1, COLOR_CONVERSION_1, 0, 1);

	/* Set size of 2nd layer */
	if (LCD_GetSwapXYEx(1)) {
		LCD_SetSizeEx (1, YSIZE_PHYS, XSIZE_PHYS);
		LCD_SetVSizeEx(1, YSIZE_PHYS * NUM_VSCREENS, XSIZE_PHYS);
	} else {
		LCD_SetSizeEx (1, XSIZE_PHYS, YSIZE_PHYS);
		LCD_SetVSizeEx(1, XSIZE_PHYS, YSIZE_PHYS * NUM_VSCREENS);
	}
#endif

	/*Initialize GUI Layer structure */
	layer_prop[0].address = LCD_LAYER0_FRAME_BUFFER;

#if (GUI_NUM_LAYERS > 1)
	layer_prop[1].address = LCD_LAYER1_FRAME_BUFFER;
#endif

	/* Setting up VRam address and custom functions for CopyBuffer-, CopyRect- and FillRect operations */
	for (i = 0; i < GUI_NUM_LAYERS; i++) {

		layer_prop[i].pColorConvAPI = (LCD_API_COLOR_CONV *) apColorConvAPI[i];

		layer_prop[i].pending_buffer = -1;

		/* Set VRAM address */
		LCD_SetVRAMAddrEx(i, (void *) (layer_prop[i].address));

		/* Remember color depth for further operations */
		layer_prop[i].BytesPerPixel = LCD_GetBitsPerPixelEx(i) >> 3;

