foldvarid93/STM32F746G-DISCO_STemWin_FreeRTOS/Src/STemwin_wrapper.c
		/* Set custom functions for several operations */
		LCD_SetDevFunc(i, LCD_DEVFUNC_COPYBUFFER,
				(void (*)(void)) CUSTOM_CopyBuffer);
		LCD_SetDevFunc(i, LCD_DEVFUNC_COPYRECT,
				(void (*)(void)) CUSTOM_CopyRect);
		LCD_SetDevFunc(i, LCD_DEVFUNC_FILLRECT,
				(void (*)(void)) CUSTOM_FillRect);

		/* Set up drawing routine for 32bpp bitmap using DMA2D */
		if (LCD_LL_GetPixelformat(i) == LTDC_PIXEL_FORMAT_ARGB8888) {
			LCD_SetDevFunc(i, LCD_DEVFUNC_DRAWBMP_32BPP,
					(void (*)(void)) CUSTOM_DrawBitmap32bpp); /* Set up drawing routine for 32bpp bitmap using DMA2D. Makes only sense with ARGB8888 */
		}
	}
}

/**
 * @brief  This function is called by the display driver for several purposes.
 *         To support the according task the routine needs to be adapted to
 *         the display controller. Please note that the commands marked with
 *         'optional' are not cogently required and should only be adapted if
 *         the display controller supports these features
 * @param  LayerIndex: Index of layer to be configured
 * @param  Cmd       :Please refer to the details in the switch statement below
 * @param  pData     :Pointer to a LCD_X_DATA structure
 * @retval Status (-1 : Error,  0 : Ok)
 */
int LCD_X_DisplayDriver(unsigned LayerIndex, unsigned Cmd, void * pData) {
	int r = 0;
	U32 addr;
	int xPos, yPos;
	U32 Color;

	switch (Cmd) {
	case LCD_X_INITCONTROLLER:
		LCD_LL_LayerInit(LayerIndex);
		break;

	case LCD_X_SETORG:
		addr = layer_prop[LayerIndex].address
				+ ((LCD_X_SETORG_INFO *) pData)->yPos
						* layer_prop[LayerIndex].xSize
						* layer_prop[LayerIndex].BytesPerPixel;
		HAL_LTDC_SetAddress(&hltdc, addr, LayerIndex);
		break;

	case LCD_X_SHOWBUFFER:
		layer_prop[LayerIndex].pending_buffer =
				((LCD_X_SHOWBUFFER_INFO *) pData)->Index;
		break;

	case LCD_X_SETLUTENTRY:
		HAL_LTDC_ConfigCLUT(&hltdc,
				(uint32_t *) &(((LCD_X_SETLUTENTRY_INFO *) pData)->Color), 1,
				LayerIndex);
		break;

	case LCD_X_ON:
		__HAL_LTDC_ENABLE(&hltdc);
		break;

	case LCD_X_OFF:
		__HAL_LTDC_DISABLE(&hltdc);
		break;

	case LCD_X_SETVIS:
		if (((LCD_X_SETVIS_INFO *) pData)->OnOff == ENABLE) {
			__HAL_LTDC_LAYER_ENABLE(&hltdc, LayerIndex);
		} else {
			__HAL_LTDC_LAYER_DISABLE(&hltdc, LayerIndex);
		}
		__HAL_LTDC_RELOAD_CONFIG(&hltdc);
		break;

	case LCD_X_SETPOS:
		HAL_LTDC_SetWindowPosition(&hltdc, ((LCD_X_SETPOS_INFO *) pData)->xPos,
				((LCD_X_SETPOS_INFO *) pData)->yPos, LayerIndex);
		break;

	case LCD_X_SETSIZE:
		GUI_GetLayerPosEx(LayerIndex, &xPos, &yPos);
		layer_prop[LayerIndex].xSize = ((LCD_X_SETSIZE_INFO *) pData)->xSize;
		layer_prop[LayerIndex].ySize = ((LCD_X_SETSIZE_INFO *) pData)->ySize;
		HAL_LTDC_SetWindowPosition(&hltdc, xPos, yPos, LayerIndex);
		break;

	case LCD_X_SETALPHA:
		HAL_LTDC_SetAlpha(&hltdc, ((LCD_X_SETALPHA_INFO *) pData)->Alpha,
				LayerIndex);
		break;

	case LCD_X_SETCHROMAMODE:
		if (((LCD_X_SETCHROMAMODE_INFO *) pData)->ChromaMode != 0) {
			HAL_LTDC_EnableColorKeying(&hltdc, LayerIndex);
		} else {
			HAL_LTDC_DisableColorKeying(&hltdc, LayerIndex);
		}
		break;

	case LCD_X_SETCHROMA:

		Color = ((((LCD_X_SETCHROMA_INFO *) pData)->ChromaMin & 0xFF0000) >> 16)
				|\
 (((LCD_X_SETCHROMA_INFO *) pData)->ChromaMin & 0x00FF00)
				|\
 ((((LCD_X_SETCHROMA_INFO *) pData)->ChromaMin & 0x0000FF)
						<< 16);

		HAL_LTDC_ConfigColorKeying(&hltdc, Color, LayerIndex);
		break;

	default:
		r = -1;
	}
	return r;
}

/**
 * @brief  Initialize the LCD Controller.
 * @param  LayerIndex : layer Index.
 * @retval None
 */
static void LCD_LL_LayerInit(U32 LayerIndex) {
	LTDC_LayerCfgTypeDef layer_cfg;

	if (LayerIndex < GUI_NUM_LAYERS) {
		/* Layer configuration */
		layer_cfg.WindowX0 = 0;
		layer_cfg.WindowX1 = XSIZE_PHYS;
		layer_cfg.WindowY0 = 0;
		layer_cfg.WindowY1 = YSIZE_PHYS;
		layer_cfg.PixelFormat = LCD_LL_GetPixelformat(LayerIndex);
		layer_cfg.FBStartAdress = ((uint32_t) 0xC0000000);
		layer_cfg.Alpha = 255;
		layer_cfg.Alpha0 = 0;
		layer_cfg.Backcolor.Blue = 0;
		layer_cfg.Backcolor.Green = 0;
		layer_cfg.Backcolor.Red = 0;
		layer_cfg.BlendingFactor1 = LTDC_BLENDING_FACTOR1_PAxCA;
		layer_cfg.BlendingFactor2 = LTDC_BLENDING_FACTOR2_PAxCA;
		layer_cfg.ImageWidth = XSIZE_PHYS;
		layer_cfg.ImageHeight = YSIZE_PHYS;
		HAL_LTDC_ConfigLayer(&hltdc, &layer_cfg, LayerIndex);

		/* Enable LUT on demand */
		if (LCD_GetBitsPerPixelEx(LayerIndex) <= 8) {
			/* Enable usage of LUT for all modes with <= 8bpp*/
			HAL_LTDC_EnableCLUT(&hltdc, LayerIndex);
		}
	}
}

/**
 * @brief  Initialize the LCD Controller.
 * @param  LayerIndex : layer Index.
 * @retval None
 */
static void LCD_LL_Init(void) {
	/* DeInit */
	HAL_LTDC_DeInit(&hltdc);

	/* Set LCD Timings */
	hltdc.Init.HorizontalSync = 40;
	hltdc.Init.VerticalSync = 9;
	hltdc.Init.AccumulatedHBP = 53;
	hltdc.Init.AccumulatedVBP = 11;
	hltdc.Init.AccumulatedActiveH = 283;
	hltdc.Init.AccumulatedActiveW = 533;
	hltdc.Init.TotalHeigh = 285;
	hltdc.Init.TotalWidth = 565;

	/* background value */
	hltdc.Init.Backcolor.Blue = 0;
	hltdc.Init.Backcolor.Green = 0;
	hltdc.Init.Backcolor.Red = 0;

	/* Polarity */
	hltdc.Init.HSPolarity = LTDC_HSPOLARITY_AL;
	hltdc.Init.VSPolarity = LTDC_VSPOLARITY_AL;
	hltdc.Init.DEPolarity = LTDC_DEPOLARITY_AL;
	hltdc.Init.PCPolarity = LTDC_PCPOLARITY_IPC;
	hltdc.Instance = LTDC;

	HAL_LTDC_Init(&hltdc);
	HAL_LTDC_ProgramLineEvent(&hltdc, 0);

	/* Enable dithering */
	HAL_LTDC_EnableDither(&hltdc);

	/* Configure the DMA2D default mode */
	hdma2d.Init.Mode = DMA2D_R2M;
	hdma2d.Init.ColorMode = DMA2D_OUTPUT_ARGB8888;//DMA2D_RGB565;
	hdma2d.Init.OutputOffset = 0x0;

	hdma2d.Instance = DMA2D;

	if (HAL_DMA2D_Init(&hdma2d) != HAL_OK) {
		while (1)
			;
	}

	/* Assert display enable LCD_DISP pin */
	HAL_GPIO_WritePin(GPIOI, GPIO_PIN_12, GPIO_PIN_SET);

	/* Assert backlight LCD_BL_CTRL pin */
	HAL_GPIO_WritePin(GPIOK, GPIO_PIN_3, GPIO_PIN_SET);

}

/**
 * @brief  Return Pixel format for a given layer
 * @param  LayerIndex : Layer Index
 * @retval Status ( 0 : 0k , 1: error)
 */
static void DMA2D_CopyBuffer(U32 LayerIndex, void * pSrc, void * pDst,
		U32 xSize, U32 ySize, U32 OffLineSrc, U32 OffLineDst) {
	U32 PixelFormat;

	PixelFormat = LCD_LL_GetPixelformat(LayerIndex);
	DMA2D->CR = 0x00000000UL | (1 << 9);

	/* Set up pointers */
	DMA2D->FGMAR = (U32) pSrc;
	DMA2D->OMAR = (U32) pDst;
	DMA2D->FGOR = OffLineSrc;
	DMA2D->OOR = OffLineDst;

	/* Set up pixel format */
	DMA2D->FGPFCCR = PixelFormat;

	/*  Set up size */
	DMA2D->NLR = (U32) (xSize << 16) | (U16) ySize;

	DMA2D->CR |= DMA2D_CR_START;

	/* Wait until transfer is done */
	while (DMA2D->CR & DMA2D_CR_START) {
	}
}

/**
 * @brief  Fill Buffer
 * @param  LayerIndex : Layer Index
 * @param  pDst:        pointer to destination
 * @param  xSize:       X size
 * @param  ySize:       Y size
 * @param  OffLine:     offset after each line
 * @param  ColorIndex:  color to be used.
 * @retval None.
 */
static void DMA2D_FillBuffer(U32 LayerIndex, void * pDst, U32 xSize, U32 ySize,
		U32 OffLine, U32 ColorIndex) {

	U32 PixelFormat;

	PixelFormat = LCD_LL_GetPixelformat(LayerIndex);

	/* Set up mode */
	DMA2D->CR = 0x00030000UL | (1 << 9);
	DMA2D->OCOLR = ColorIndex;

	/* Set up pointers */
	DMA2D->OMAR = (U32) pDst;

