foldvarid93/STM32F746G-DISCO_STemWin_FreeRTOS/Src/STemwin_wrapper.c
	/* Set up offsets */
	DMA2D->OOR = OffLine;

	/* Set up pixel format */
	DMA2D->OPFCCR = PixelFormat;

	/*  Set up size */
	DMA2D->NLR = (U32) (xSize << 16) | (U16) ySize;

	DMA2D->CR |= DMA2D_CR_START;

	/* Wait until transfer is done */
	while (DMA2D->CR & DMA2D_CR_START) {
	}
}

/**
 * @brief  Get buffer size
 * @param  LayerIndex : Layer Index
 * @retval None.
 */
static U32 GetBufferSize(U32 LayerIndex) {
	U32 BufferSize;

	BufferSize = layer_prop[LayerIndex].xSize * layer_prop[LayerIndex].ySize
			* layer_prop[LayerIndex].BytesPerPixel;
	return BufferSize;
}

/**
 * @brief  Customized copy buffer
 * @param  LayerIndex : Layer Index
 * @param  IndexSrc:    index source
 * @param  IndexDst:    index destination
 * @retval None.
 */
static void CUSTOM_CopyBuffer(int LayerIndex, int IndexSrc, int IndexDst) {
	U32 BufferSize, AddrSrc, AddrDst;

	BufferSize = GetBufferSize(LayerIndex);
	AddrSrc = layer_prop[LayerIndex].address + BufferSize * IndexSrc;
	AddrDst = layer_prop[LayerIndex].address + BufferSize * IndexDst;
	DMA2D_CopyBuffer(LayerIndex, (void *) AddrSrc, (void *) AddrDst,
			layer_prop[LayerIndex].xSize, layer_prop[LayerIndex].ySize, 0, 0);
	layer_prop[LayerIndex].buffer_index = IndexDst;
}

/**
 * @brief  Copy rectangle
 * @param  LayerIndex : Layer Index
 * @param  x0:          X0 position
 * @param  y0:          Y0 position
 * @param  x1:          X1 position
 * @param  y1:          Y1 position
 * @param  xSize:       X size.
 * @param  ySize:       Y size.
 * @retval None.
 */
static void CUSTOM_CopyRect(int LayerIndex, int x0, int y0, int x1, int y1,
		int xSize, int ySize) {
	U32 AddrSrc, AddrDst;

	AddrSrc = layer_prop[LayerIndex].address
			+ (y0 * layer_prop[LayerIndex].xSize + x0)
					* layer_prop[LayerIndex].BytesPerPixel;
	AddrDst = layer_prop[LayerIndex].address
			+ (y1 * layer_prop[LayerIndex].xSize + x1)
					* layer_prop[LayerIndex].BytesPerPixel;
	DMA2D_CopyBuffer(LayerIndex, (void *) AddrSrc, (void *) AddrDst, xSize,
			ySize, layer_prop[LayerIndex].xSize - xSize,
			layer_prop[LayerIndex].xSize - xSize);
}

/**
 * @brief  Fill rectangle
 * @param  LayerIndex : Layer Index
 * @param  x0:          X0 position
 * @param  y0:          Y0 position
 * @param  x1:          X1 position
 * @param  y1:          Y1 position
 * @param  PixelIndex:  Pixel index.
 * @retval None.
 */
static void CUSTOM_FillRect(int LayerIndex, int x0, int y0, int x1, int y1,
		U32 PixelIndex) {
	U32 BufferSize, AddrDst;
	int xSize, ySize;

	if (GUI_GetDrawMode() == GUI_DM_XOR) {
		LCD_SetDevFunc(LayerIndex, LCD_DEVFUNC_FILLRECT, NULL);
		LCD_FillRect(x0, y0, x1, y1);
		LCD_SetDevFunc(LayerIndex, LCD_DEVFUNC_FILLRECT,
				(void (*)(void)) CUSTOM_FillRect);
	} else {
		xSize = x1 - x0 + 1;
		ySize = y1 - y0 + 1;
		BufferSize = GetBufferSize(LayerIndex);
		AddrDst = layer_prop[LayerIndex].address
				+ BufferSize * layer_prop[LayerIndex].buffer_index
				+ (y0 * layer_prop[LayerIndex].xSize + x0)
						* layer_prop[LayerIndex].BytesPerPixel;
		DMA2D_FillBuffer(LayerIndex, (void *) AddrDst, xSize, ySize,
				layer_prop[LayerIndex].xSize - xSize, PixelIndex);
	}
}

/**
 * @brief  Draw indirect color bitmap
 * @param  pSrc: pointer to the source
 * @param  pDst: pointer to the destination
 * @param  OffSrc: offset source
 * @param  OffDst: offset destination
 * @param  PixelFormatDst: pixel format for destination
 * @param  xSize: X size
 * @param  ySize: Y size
 * @retval None
 */
static void CUSTOM_DrawBitmap32bpp(int LayerIndex, int x, int y, U8 const * p,
		int xSize, int ySize, int BytesPerLine) {
	U32 BufferSize, AddrDst;
	int OffLineSrc, OffLineDst;

	BufferSize = GetBufferSize(LayerIndex);
	AddrDst = layer_prop[LayerIndex].address
			+ BufferSize * layer_prop[LayerIndex].buffer_index
			+ (y * layer_prop[LayerIndex].xSize + x)
					* layer_prop[LayerIndex].BytesPerPixel;
	OffLineSrc = (BytesPerLine / 4) - xSize;
	OffLineDst = layer_prop[LayerIndex].xSize - xSize;
	DMA2D_CopyBuffer(LayerIndex, (void *) p, (void *) AddrDst, xSize, ySize,
			OffLineSrc, OffLineDst);
}

static void TransferComplete(DMA2D_HandleTypeDef *hdma2d) {
	TransferInProgress = 0;
}

void DMA2D_Init(void) {
	/* Configure the DMA2D transfer complete callback mode */
	hdma2d.XferCpltCallback = TransferComplete;

	if (HAL_DMA2D_Init(&hdma2d) != HAL_OK) {
		Error_Handler();
	}

	if (HAL_DMA2D_ConfigLayer(&hdma2d, 1) != HAL_OK) {
		Error_Handler();
	}

}

void GRAPHICS_Init(void) {
	MX_FMC_Init();
	BSP_SDRAM_Init();
#if   GUI_SUPPORT_TOUCH
	if (BSP_TS_Init(BSP_LCD_GetXSize(), BSP_LCD_GetYSize()) != TS_OK) {
		while (1);
	}
#endif
	GUI_Init();/* Initialize the GUI */
	WM_MULTIBUF_Enable(1);/* Enable the multi-buffering functionality */
	WM_SetCreateFlags(WM_CF_MEMDEV);	/* USER CODE BEGIN WM_SetCreateFlags */
}

void TouchUpdate(void) {
	static GUI_PID_STATE GUI_TS_State = { 0, 0, 0, 0 };
	//TS_StateTypeDef TS_State;
	uint16_t xDiff, yDiff;

	BSP_TS_GetState(&TS_State);

	if ((TS_State.touchX[0] >= LCD_GetXSize()) || (TS_State.touchY[0] >= LCD_GetYSize())) {
		TS_State.touchX[0] = 0;
		TS_State.touchY[0] = 0;
		TS_State.touchDetected = 0;
	}

	xDiff = (GUI_TS_State.x > TS_State.touchX[0]) ?
			(GUI_TS_State.x - TS_State.touchX[0]) : (TS_State.touchX[0] - GUI_TS_State.x);
	yDiff = (GUI_TS_State.y > TS_State.touchY[0]) ?
			(GUI_TS_State.y - TS_State.touchY[0]) : (TS_State.touchY[0] - GUI_TS_State.y);

	if ((GUI_TS_State.Pressed != TS_State.touchDetected) || (xDiff > 10)
			|| (yDiff > 10)) {
		GUI_TS_State.Pressed = TS_State.touchDetected;
		//GUI_TS_State.Layer = SelLayer;
		if (TS_State.touchDetected) {
			GUI_TS_State.x = TS_State.touchX[0];
			GUI_TS_State.y = TS_State.touchY[0];
			GUI_TOUCH_StoreStateEx(&GUI_TS_State);
		} else {
			GUI_TOUCH_StoreStateEx(&GUI_TS_State);
			GUI_TS_State.x = 0;
			GUI_TS_State.y = 0;
		}
	}
}
void TouchUpdate2(void)
{
  static GUI_PID_STATE TS_State = {0, 0, 0, 0};
  __IO TS_StateTypeDef  ts;
  uint16_t xDiff, yDiff;

  BSP_TS_GetState((TS_StateTypeDef *)&ts);

  if((ts.touchX[0] >= LCD_GetXSize()) ||(ts.touchY[0] >= LCD_GetYSize()) )
  {
    ts.touchX[0] = 0;
    ts.touchY[0] = 0;
    ts.touchDetected =0;
  }

  xDiff = (TS_State.x > ts.touchX[0]) ? (TS_State.x - ts.touchX[0]) : (ts.touchX[0] - TS_State.x);
  yDiff = (TS_State.y > ts.touchY[0]) ? (TS_State.y - ts.touchY[0]) : (ts.touchY[0] - TS_State.y);


  if((TS_State.Pressed != ts.touchDetected ) ||
     (xDiff > 30 )||
      (yDiff > 30))
  {
    TS_State.Pressed = ts.touchDetected;
    TS_State.Layer = 0;
    if(ts.touchDetected)
    {
      TS_State.x = ts.touchX[0];
      TS_State.y = ts.touchY[0];
      GUI_TOUCH_StoreStateEx(&TS_State);
    }
    else
    {
      GUI_TOUCH_StoreStateEx(&TS_State);
      TS_State.x = 0;
      TS_State.y = 0;
    }
  }
}
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
